In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("dvd rental final csv.csv")

In [4]:
df.shape

(405315, 9)

In [7]:
df.nunique()

customer_id      599
active             2
create_date        1
last_update        1
rental_date    15815
return_date    15836
amount            19
category          16
language           1
dtype: int64

In [9]:
df.duplicated().sum()

np.int64(278442)

In [12]:
df = df.drop_duplicates()

In [13]:
df

,customer_id,active,create_date,last_update,rental_date,return_date,amount,category,language
0,459,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:54:33,2005-05-28 19:40:33,4.99,Music,English
2,459,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:54:33,2005-05-28 19:40:33,2.99,Music,English
3,459,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:54:33,2005-05-28 19:40:33,6.99,Music,English
5,459,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:54:33,2005-05-28 19:40:33,10.99,Music,English
6,459,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:54:33,2005-05-28 19:40:33,9.99,Music,English
...,...,...,...,...,...,...,...,...,...
405294,130,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:53:30,2005-05-26 22:04:30,4.99,Family,English
405295,130,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:53:30,2005-05-26 22:04:30,0.99,Family,English
405298,130,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:53:30,2005-05-26 22:04:30,3.99,Family,English
405304,130,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:53:30,2005-05-26 22:04:30,6.99,Family,English
405305,130,1,2006-02-14,2013-05-26 14:49:45.738,2005-05-24 22:53:30,2005-05-26 22:04:30,2.99,Family,English

In [14]:
df.isnull().sum()

customer_id       0
active            0
create_date       0
last_update       0
rental_date       0
return_date    1477
amount            0
category          0
language          0
dtype: int64

In [15]:
df['create_date'].value_counts()

create_date
2006-02-14    126873
Name: count, dtype: int64